#+TITLE: Notes
#+AUTHOR: Vittorio Zaccaria
#+LEVEL: 3
#+OPTIONS: H:3
#+BEAMER_HEADER: \input{header.tex}
#+STARTUP: indent 

#+TAGS: noanki(n) focus(f)

*** Monads from adjoint functors 
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
D~\textrm{with}~\epsilon: LR \rightarrow I_d \arrow[rr, "R(\textrm{ight})", bend right=49] & \bot & C~\textrm{with}~\eta: I_c \rightarrow R L \arrow[ll, "L(\textrm{eft})", bend right=49]
\end{tikzcd}
#+END_EXPORT
    - A monad is the shadow cast by an adjunction into the domain of the left-adjoint $C$.
    - It raises from natural transformations that one can build on the base functor $T=RL$.
    - The adjunction ensures that $\mu: RLRL \rightarrow RL$ is natural.
*** Monads from adjoint functors (Maybe monad)
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
Set_{*} \arrow[rr, "R(\textrm{ight})~\textrm{forgetful}", bend right=49] & \bot & Set  \arrow[ll, "L(\textrm{eft}) ~ \textrm{free}", bend right=49]
\end{tikzcd}
#+END_EXPORT

- The left-adjoint is *free* and takes 
   - each set $S$ to $(S \cup \{\nu_S\}, \nu_S)$. 
   - each $f: S_1 \rightarrow S_2$ to a function $f^*$ such that $f^*(s)=f(s), f^*(\nu_A) = \nu_B$
- The right-adjoint maps to $S \cup \{\nu_S\}$ and $f^*$.
- $\eta = LR$ adds a new basepoint to the set and the natural transformation is given
  by natural inclusion.
- $\mu = LRLR$ map the two new points (because we have to LR in series) to a single
  given by $LR$.

*** Adjoint functors 
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
D~\textrm{with}~\epsilon: LR \rightarrow I_d \arrow[rr, "R(\textrm{ight})", bend right=49] & \bot & C~\textrm{with}~\eta: I_c \rightarrow R L \arrow[ll, "L(\textrm{eft})", bend right=49]
\end{tikzcd}
#+END_EXPORT
    - Two categories $C$ and $D$ are equivalent if I can build two functors, one
      going left $L: D \leftarrow C$ and $R: D \rightarrow C$ if their
      composition is naturally isomorphic, through $\eta$ and $\epsilon$, to the
      identity functor.
    - We say that $L$ is /left adjoint/ to R
